install/build/camera-setting/template-rule.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:act="http://www.axis.com/vapix/ws/action1"
               xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:tns1="http://www.onvif.org/ver10/topics"
               xmlns:tnsaxis="http://www.axis.com/2009/event/topics">
    <soap:Header/>
    <soap:Body>
        <act:AddActionRule>
            <act:NewActionRule>
                <act:Name>system restarted</act:Name>
                <act:Enabled>true</act:Enabled>
                <act:StartEvent>
                    <wsnt:TopicExpression Dialect="http://docs.oasis-open.org/wsn/t-1/TopicExpression/Concrete">tns1:Device/tnsaxis:Status/SystemReady</wsnt:TopicExpression>
                    <wsnt:MessageContent Dialect="http://www.onvif.org/ver10/tev/messageContentFilter/ItemFilter">boolean(//SimpleItem[@Name="ready" and @Value="1"])</wsnt:MessageContent>
                </act:StartEvent>
            </act:NewActionRule>
        </act:AddActionRule>
    </soap:Body>
</soap:Envelope>
